Repository: VladislavKoryavko/CV
Catalog: src/i18n/messages.*.xlf
Languages: ru

# fio
source: Vladislav Korauko
ru: Владислав Корявко

# speciality
source: Software developer
ru: Программист Разработчик

# localized-id-about-me
source: About me
ru: Обо мне

# welcome
source: Welcome to my page!
ru: Добро Пожаловать!

# my-name
source: My name is Vladislav, and I am a Programmer
ru: Меня зовут Владислав, я Программист

# about-me-tex
source: Since childhood, programming and exact sciences have been my passion. In many of them, I won prizes both at school and city Olympiads. The first practical application of my knowledge was the creation of various electronic devices based on microcontrollers. While studying at the Polytechnic, I had the opportunity to participate in competitions of scientific and technical creativity, where, having passed the district and regional stages, I won a prize in the Republican competitions. Over time, the hobby grew into a job, during which I happened to use many advanced programming and microelectronic technologies. Once, having accepted an offer that was interesting to me, I left my passion for a while and plunged into a new path of management with great interest. For four years, I served as an assistant to the general director in a trading and manufacturing company. Planning the work process, business correspondence, preparing meetings and conferences, setting tasks, and monitoring their implementation, have become my daily activities. In the flow of multitasking, my tourist soul was always especially pleased with the next training camp and preparation for our wonderful team building, which, with the light hand of our beloved Director, constantly took place in new and always exotic places. Having gained experience, I decided to try my hand at business and went on a free voyage. Having successfully completed one ambitious order, my short voyage was interrupted by the coronavirus pandemic. Under these conditions, having received job offers, I accepted it, deciding not to tempt fate in the coming unpredictable economic situation. After that, I had the opportunity to create an automated system for managing and controlling business processes, write software for a wide range of laboratory installations, and develop a backend for modern Internet applications
ru: С детства программирование и точные науки были моим увлечением. По многим из них я занимал призовые места как на школьных олимпиадах, так и на городских. Первым практическим применением моих знаний стало создание различных электронных устройств на базе микроконтроллеров. Во время учёбы в политехникуме мне доводилось участвовать в конкурсах научно-технического творчества, где пройдя районные и областные этапы, занял призовое место в Республиканских соревнованиях. Со временем хобби переросло в работу, в процессе которой мне довелось использовать большое количество передовых технологий программирования и микроэлектроники. Однажды приняв интересное мне предложение, я оставил на время моё увлечение и с большим интересом погрузился в новую для меня стезю менеджмента. На протяжении четырёх лет я выполнял функции помощника генерального директора в торгово-производственной компании. Планирования рабочего процесса, деловая переписка, подготовка встреч и совещаний, постановка задач и контроль их выполнения, стали повседневными моими делами. В потоке многозадачности, мою туристические душу, всегда особенно радовали очередные сборы и подготовка к нашим прекрасным тимбилдингам, которые с легкой руки нашего любимого Директора, постоянно проходили в новых и всегда экзотических местах. Набравшись опыта, я решил попробовать себя в деле и отправился в свободное плавание. Успешно выполнив один амбициозный заказ, моё недолгое плавание прервала пандемия коронавируса. В этих условиях получив предложения работы, я принял его, решив не искушать судьбу в грядущей непредсказуемой экономической ситуации. После этого мне довелось создавать автоматизированную систему для управления и контроля бизнес-процессов, писать программное обеспечения для большого спектра лабораторных установок и заниматься разработкой бэкенда для современных интернет-приложений.

source: Work Experience
ru: Опыт работы

# work-position-tulaco
source: Backend Developer
ru: Бэкэнд Разработчик

# work-description-tulaco
source: Developed back-end applications for hhglobal.com and stylerow.com projects. My responsibilities included writing RESTful API contracts and implementing them, creating and changing application logic, modifying the database and writing stored procedures, implementing caching, migrating from .NET Core 3.1 to .NET Core 6.0, setting up Docker. Worked with technologies: C#, .NET Core 3.1 - 6.0, Entity Framework, T-SQL, Elasticsearch, Redis, Git, Docker, Swagger, Postman, AWS, QuickBooks, Pardot, Twilio
ru: Разрабатывал серверную часть приложений для проектов hhglobal.com и stylerow.com. В мои обязанности входило написание RESTful API контрактов и их реализация, создание и изменение логики приложений, модификация базы данных и написания хранимых процедур, реализация кеширования, миграция с .NET Core 3.1 на .NET Core 6.0, настройка Docker. Работал с технологиями: C#, .NET Core 3.1 – 6.0, Entity Framework, T-SQL, Elasticsearch, Redis, Git, Docker, Swagger, Postman, AWS, QuickBooks, Pardot, Twilio.

# work-name-didactika
source: Didactika
ru: Дидактика

# work-position-didactika
source: Desktop Developer and System Administrator
ru: Десктоп Разработчик / Системный Администратор

# work-description-didactika
source: Developed desktop applications for laboratory equipment. Created a common application that integrates software for the entire range of manufactured equipment, introduced a common standard for the software being created, automated and optimized the process of creating applications. Made a migration from .net framework to .net core 3.1. Worked with technologies: C#, .NET Framework, .NET Core 3.1, Entity Framework, Git, SQL, SQLite, WPF, MVVM.
ru: Разрабатывал десктопные приложения для лабораторного оборудования. Создал общее приложение интегрирующее в себе ПО для всего спектра выпускаемого оборудования, внедрил общий стандарт для создаваемого ПО, автоматизировал и оптимизировал процесс создания приложений. Произвёл миграцию с .net framework на .net core 3.1. Работал с технологиями: C#, .NET Framework, .NET Core 3.1, Entity Framework, Git, SQL, SQLite, WPF, MVVM.

# work-name-glavmolsnab
source: Glavmolsnab
ru: Главмолснаб

# work-position-glavmolsnab-programmer
source: Software Developer
ru: Разработчик программного обеспечения

# work-description-glavmolsnab-programmer
source: Creation and implementation of an automated sales management system that combines enterprise servers, specialists in remote offices working on a PC, and specialists in the "fields" working from a smartphone or tablet. This software solution allows you to plan sales based on existing data, set and redirect personal tasks to employees, monitor their implementation/deadlines, calculate bonuses, and compile reports.
ru: Создание и внедрение автоматизированной системы управления продажами, объединяющий в себе сервера предприятия, специалистов в удалённых офисах работающих на ПК, и специалистов в "полях" работающих со смартфона или планшета. Данное программное решение позволяет планировать продажи опираясь на имеющиеся данные, ставить и перенаправлять персональные задачи сотрудникам, контролировать их выполнение/сроки, рассчитывать бонусы, составлять отчёты.

# work-name-frilance
source: Frilance
ru: Фриланс

# work-position-frilance-soft-hard-developer
source: Software and Hardware Developer
ru: Разработчик программного обеспечения и электронных приборов

# work-description-frilance-soft-hard-developer
source: Implementation of projects for automation of production processes using LCD/TFT, USB, TCP/IP, http/https, Touch screen, USART, TWI, Modbus, SPI, ADC, DAC... technologies: design of circuit diagrams, design and manufacture of printed boards, software development for microcontrollers, assembly and adjustment, maintenance of the implemented equipment.
ru: Реализация проектов автоматизации производственных процессов с использованием технологий LCD/TFT, USB, TCP/IP, http/https, Touch screen, USART, TWI, Modbus, SPI, ADC, DAC...: проектирование схем принципиальных электрических схем, проектирование и изготовление печатных плат, разработка программного обеспечения для микроконтроллеров, сборка и наладка, обслуживание реализованного оборудования.

# work-position-glavmolsnab-ceo-assist
source: CEO Assistant
ru: Помощник генерального директора

# work-description-glavmolsnab-ceo-assist
source: Optimization of the work schedule, preparation for meetings and meetings, taking minutes, setting and monitoring the implementation of tasks, preliminary analysis of the documentation provided (reports, applications, schedules, plans), providing the necessary information, conducting business correspondence, assisting in the coordination and communication of business units, conducting pre-selection and interviews, fulfillment of personal assignments of the head.
ru: Оптимизация рабочего графика, подготовка к собраниям и заседаниям, ведение протоколов, постановка и контроль выполнения задач, предварительный анализ предоставляемой документации (отчётов, заявок, графиков, планов), обеспечение необходимой информацией, ведение деловой переписки, помощь в координации и коммуникации подразделений предприятия, проведение предварительного отбора и собеседований, выполнение личных поручений руководителя.

# work-position-frilance-microelectronics-developer
source: Developer of software, microcontroller systems and automation
ru: Разработчик программного обеспечения, микроконтроллерных систем и автоматики

# work-description-frilance
source: Developer of software, microcontroller systems and automation Created a system of identification by ID card and visit control. Power load remote control system, Devices for reading human physiological parameters. Designed and assembled control units for various technological processes.
ru: Создал систему идентификации по ИД карте и контроля посещения. Систему удалённого управления силовой нагрузкой, Устройства считывания физиологических показателей человека. Проектировал и собирал блоки управления для различных технологических процессов.

# work-name-remavt
source: Remavt
ru: Ремавт

# work-position-remavt
source: Electrical Technician
ru: Техник-электрик

# work-description-remavt
source: Maintenance of electrical equipment.
ru: Обслуживание электрооборудование.

source: Skills
ru: Навыки

source: Education
ru: Образование

# education-name-school
source: School № 42, Mogilev
ru: Школа № 42, г. Могилёва

# education-achievements
source: Achievements:
ru: Достижения:

# education-achievements-school-school-level-title
source: Prize places at school Olympiads:
ru: Призовые места на школьных олимпиадах:

# education-achievements-school-school-level-math
source: 1st place in mathematics
ru: 1 место по математике

# education-achievements-school-school-level-physics
source: 1st place in physics
ru: 1 место по физике

# education-achievements-school-school-level-geography
source: 1st place in geography
ru: 1 место по географии

# education-achievements-school-school-level-programming
source: 2nd place in programming
ru: 2 место по программированию

# education-achievements-school-school-level-history
source: 3rd in history
ru: 3 место по истории

# education-achievements-school-city-level-title
source: Prize places at city Olympiads:
ru: Призовые места на городских олимпиадах:

# education-achievements-school-city-level-programming
source: 1st place among 9th grade students
ru: 1 место среди учеников 9-ых классов

# education-achievements-school-city-level-mathematics
source: 2nd place at the City mathematics Olympiad
ru: 2 место

# education-name-college
source: Polytechnic College, Mogilev
ru: Полетехнический колледж, Могилёв

# education-achievements-college-3rd
source: 3rd place at the Republican competition of inventors and innovators
ru: 3 место на Республиканском конкурсе изобретателей и рационализаторов

# education-achievements-college-5th
source: 5th place at the Republican competition of inventors and innovators
ru: 5 место на Республиканском конкурсе изобретателей и рационализаторов

# education-achievements-college-diploma
source: Diploma of the President for technical creativity
ru: Диплом Президента за техническое творчество

# education-name-university
source: Belarusian Russian University, Mogilev
ru: Белорусско-Российский Университет, Могилёв

# education-achievements-text-university
source: Not finished, stopped studying at my own request
ru: Не окончил, прекратил обучение по собственному желанию

source: Interests
ru: Интересы

source: Travel
ru: Путешествия

source: Electronics
ru: Электроника

source: Climbing
ru: Скалолазание

source: Exact sciences
ru: Точные науки

source: Photography
ru: Фотография

source: Snowboard
ru: Сноуборд

source: History
ru: История
